{"data":{"site":{"siteMetadata":{"author":{"name":"Anubhav Srivastava","contacts":{"twitter":"onlyanubhav"}},"disqusShortname":"theanubhav","subtitle":"Personal quick tips for Web Developers","title":"Quick Dev tips by Anubhav Srivastava","url":"http://devtips.theanubhav.com"}},"markdownRemark":{"id":"54e80347-caa4-52d4-bec1-2e738e69d916","html":"<p>JavaScript codebase bloat is real thing today than it ever was. Sites gets bigger every single day as more libraries are thrown to solve new problems. Until of-course, the big refactoring/rewrite happens. The community has solved the problem of multiple request to fetch JS script from CDN by bundling everything using tools like webpack, rollup, parcel, etc, but there is no control on increase in bundle size. With every package imported in app, results in increase in size of bundle, sometimes huge than the actual requirement.</p>\n<p>Here is an online tool (also CLI available) that would help you analyse size of package module, called <a href=\"https://bundlephobia.com\">bundlephobia</a>. his thing lets you understand the performance cost of <code class=\"language-text\">npm install</code> on a new npm package before actually adding it to your bundle. You can search over all available public packages on npm repository.</p>\n<p>Analysis report for package <code class=\"language-text\">axios-api-profiler</code> including download time and size for minified + gzipped.\n<img src=\"/media/bundle1.png\" alt=\"Screenshot\"></p>\n<p>Another thing about this tool is it shows package size breakdown, which also helps you take a call whether you are wanting to have such dependency size chain.</p>\n<p>Below is a screenshot for composition of dependency in <code class=\"language-text\">react-router@5.0.0</code>\n<img src=\"/media/bundle2.png\" alt=\"Screenshot\"></p>\n<p>Another great feature is to upload your entire <code class=\"language-text\">package.json</code> for analysis. It calculates package size for every module in package.json dependency list.\n<img src=\"/media/bundle3.png\" alt=\"Screenshot\"></p>\n<p>So next time you are adding a dependency to your project, make sure you know the cost!</p>\n<p>Official Site: <a href=\"https://bundlephobia.com\">bundlephobia.com</a></p>\n<p>Github Repo: <a href=\"https://github.com/pastelsky/bundlephobia\">bundlephobia</a></p>\n<hr>","fields":{"slug":"/posts/bundle-phobia","tagSlugs":["/tag/java-script/","/tag/performance/"]},"frontmatter":{"date":"2019-05-05T18:05:00.738Z","description":"Find the cost of adding an npm package to your bundle","tags":["JavaScript","Performance"],"title":"Analyse package size of every npm module you install"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/posts/bundle-phobia"}}