{"data":{"site":{"siteMetadata":{"author":{"name":"Anubhav Srivastava","contacts":{"twitter":"onlyanubhav"}},"disqusShortname":"theanubhav","subtitle":"Personal quick tips for Web Developers","title":"Quick Dev tips by Anubhav Srivastava","url":"http://devtips.theanubhav.com"}},"markdownRemark":{"id":"8ba4f469-3c1f-5a9f-94cd-d04ec7829330","html":"<p>We manage all npm modules, package.json, module upgrade (when we know there is new compatible version) and all other package management stuff via npm CLI commands. For most of the time, <code class=\"language-text\">npm run command</code> and <code class=\"language-text\">npm install package --save</code> is all what we need 👻. For yarn, story is no different, similar commands exists to provide same functionality.</p>\n<p>There are 2 tools that I like and haven’t disappointed me so far, and provide a GUI for managing npm packages</p>\n<p>First one, <a href=\"https://720kb.github.io/ndm/\"><code class=\"language-text\">ndm</code></a> aka “npm desktop manager” is Desktop GUI for Mac, Linux, Windows built on Electron. It is one click tool to Add, remove, update global and local packages with ease. Also provides, useful packages information and live npm registry status.</p>\n<p><img src=\"/media/ndm.png\" alt=\"Screenshot\"></p>\n<p>Official Site: <a href=\"https://720kb.github.io/ndm/\">ndm</a></p>\n<p>Second one, <a href=\"https://www.npmjs.com/package/npm-gui\">npm-gui</a> is browser based JavaScript package managers for package.json or bower.json for projects and also manages global dependencies. Under the hood it will use transparently npm, bower or yarn commands to install, remove or update dependencies. It also provides a way to run all “scripts” under script section of package json from UI and dumps the console output of the command. It can be installed as global npm module as well as locally.</p>\n<p><img src=\"/media/npm-gui.png\" alt=\"Screenshot\"></p>\n<p>Official Site: <a href=\"https://github.com/q-nick/npm-gui\">npm-gui</a></p>\n<hr>","fields":{"slug":"/posts/ui-for-npm","tagSlugs":["/tag/java-script/","/tag/npm/"]},"frontmatter":{"date":"2019-04-18T18:05:00.738Z","description":"Set of tools that provide GUI interfaces for managing you npm packages, both global and project.","tags":["JavaScript","NPM"],"title":"Manage all of your npm packages for a project from UI"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/posts/ui-for-npm"}}