{"data":{"site":{"siteMetadata":{"author":{"name":"Anubhav Srivastava","contacts":{"twitter":"onlyanubhav"}},"disqusShortname":"theanubhav","subtitle":"Personal quick tips for Web Developers","title":"Quick Dev tips by Anubhav Srivastava","url":"http://devtips.theanubhav.com"}},"markdownRemark":{"id":"475bea45-0ceb-565b-a5c9-6b516ce9dace","html":"<p>Reading mode is an alternative web rendering mode where the web browser try to strip out repeated and irrelevant content; such as page navigation, ads, and distractions.</p>\n<p>Reading mode is of great use when reading articles on platforms like medium.com. Additionally, print version of those articles take from reading mode is clutter free and gives great feel to read offline.</p>\n<p>Safari has an integrated “Reader Mode” feature, and it’s easy to use. After you load a web page in Safari, you’ll see an icon at the left side of the address bar at the top of the app. This icon will only appear if Safari detects the current web page is an “article,” so it won’t be available on every web page.</p>\n<p><strong>Note black dash icon in navbar</strong>\n<img src=\"/media/reader-mode.png\" alt=\"Screenshot\"></p>\n<p>Chrome also has this feature and calls it as “Distill Mode”, but would require some experimental parameters (<code class=\"language-text\">--enable-dom-distiller</code>) to turned on before it can be used. One can refer this <a href=\"https://www.cnet.com/how-to/how-to-enable-reader-mode-in-chrome/\">post</a> to do so. Another way, and my personal one is, using <a href=\"https://mercury.postlight.com/reader/\">Mercury Reader</a> chrome extension. There are many chrome extension giving you the same behavior, but Mercury Reader hasn’t disappointed me so far. I explicitly use mercury reader for printing articles since safari’s in built reader output has disappointed my printer on some occasions.</p>\n<hr>","fields":{"slug":"/posts/read-mode-tool","tagSlugs":["/tag/tools/","/tag/browser/"]},"frontmatter":{"date":"2019-04-13T18:05:00.738Z","description":"Want to remove distractions from the websites you are just trying to read? or read an articles/blog in distraction free view? Try Reader/Distill mode.","tags":["Tools","Browser"],"title":"Better view to read an article via Reader/Distill Mode"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/posts/read-mode-tool"}}